Repository: yereverluvinunclebert/Panzer-Weather-Widget
Catalog: contents/Resources/*/Localizable.strings
Languages: ro

source: Pressure
ro: Presiune

source: Temperature
ro: Temperatura

source: Humidity
ro: Umezeala

source: Double tap on me to get new weather
ro: Atingeti de doua ori pe mine pentru a obtine Vremea noi

source: Few clouds at night
ro: Cer partial noros noaptea

source: Sunny with few clouds
ro: Cer insorit, partial noros

source: Scattered
ro: Cer mai mult senin

source: Overcast
ro: Cer acoperit

source: Light rain
ro: Ploaie usoara

source: Moderate rain
ro: Ploaie moderata

source: Heavy rain
ro: Ploaie torentiala

source: Rain
ro: Ploaie

source: Fog
ro: Ceata

source: Hail
ro: Grindina

source: Snow
ro: Ninsoare

source: Thunder
ro: Descarcari electrice

source: Heavy hail
ro: Grindina puternica

source: Heavy snow
ro: Ninsoare abundenta

source: Light hail
ro: Grindina

source: Light snow
ro: Ninsoare slaba

source: Clear
ro: Cer senin

# _Search_city
source: Search for a city
ro: Cauta oras

source: City not found
ro: Orasul nu a putut fi gasit

source: No recent data available
ro: Nu sunt disponibile date actualizate

source: Updated
ro: Actualizat acum

source: one hour
ro: o ora

source: hours
ro: ore

source: and one minute
ro: si un minut

source: and
ro: si

source: minutes
ro: minute

source: ago
ro: în urma

source: Updated one minute ago
ro: Actualizat acum un minut

source: minutes ago
ro: minute în urma

source: Updated one second ago
ro: Actualizat în urma o secunda

source: seconds ago
ro: secunde în urma

# _alertstr1
source: No available data for the chosen city, please choose another location with a valid metar weather feed, Preferably a city with an airport, eg. Gatwick/Heathrow.
ro: Nu exista date disponibile pentru orasul alesnva rugam sa alegeti o alta locatie cu un feed valid vreme METAR De preferinta, un oras, cu un aeroport, de exemplu - Gatwick/Heathrow.

source: Please enter the name of your desired city, first
ro: Introduceti mai intai numele orasului, în primul rBnd

# _Please_enter_the_name_of_your_desired_icao_first
source: Please enter the code of your desired icao, first
ro: Va rugam sa introduceti codul de ICAO dorit, în primul rBnd

source: Searching
ro: Caut

source: The current time is
ro: Ora curenta este

source: Click on me to open the glass
ro: Click pe mine pentru a deschide sticla

# _Click_on_me_to_close_the_glass
source: Click and hold to view more help
ro: Click pe mine pentru a închide geamul

source: Tap on me to get new weather
ro: Apasati pe mine pentru a obtine Vremea noi

# _Click_here_to_view_meteorological_site
source: Click here to view meteorological site http://www.aviationweather.gov/
ro: Click aici pentru a vizualiza site-ul meteorologice http://www.aviationweather.gov

source: toggle centigrade/fahrenheit here
ro: comuta grade Celsius or Fahrenheit aici

source: Click here to select
ro: Click aici pentru a selecta

source: Click here to cancel
ro: Click aici pentru a anula

source: Click on me to mute or unmute sounds
ro: Click pe mine pentru a dezactiva sau a activa sunete

source: Click on me to stop or start animations
ro: Click pe mine pentru a opri sau porni animatii

# _lock_widget
source: Click anywhere on the rim to lock the widget in place
ro: Face?i clic oriunde pe janta pentru a bloca widget-ul în loc

source: Click on me to show the widget preferences
ro: Click pe mine pentru a arata preferintele widget

source: Click on me to visit the on-line help page
ro: Click pe mine pentru a vizita pagina de ajutor on-line

source: set new location
ro: stabilit noua locatie

source: Search Results
ro: Rezultatele cautarii

source: Widget Size
ro: Widget Dimensiune

source: Clock Style
ro: Ceas Vizibilitate

source: Sound Control
ro: de control al sunetului

source: Animation Control
ro: Controlul animatie

source: Language Selection
ro: Selectarea limbii

# _Decreases_the_total_size_of_the_weather_gauge
source: Changes the total size of the weather gauge. Vary the percentage and the whole gauge will alter in size.
ro: Scade dimensiunea totala a gabaritului vreme. Variaza cursorul si întreaga ecartamentul va reduce în dimensiuni.

# _Change_the_appearance_of_the_24hr_clock
source: Change the appearance of the 24hr clock. Set to WIND to display the wind direction, any other selection shows time.
ro: Modificarea aspectului ceasului 24. Setati pentru a vântului pentru a afita directia vântului, orice alta selectie arata timp.

source: Enable or disable sound as you require.
ro: A activa sau dezactiva sunetul în functie de nevoie.

source: Enable or disable animation as you require.
ro: Activarea sau dezactivarea animatie ca ai nevoie.

# _Add_your_own_language_here
source: Select the default language (EN), if you select the alternative language it will use the language code below.
ro: Adauga propria ta limba aici. Adaugati doua codul de limba litera de mai jos.

source: Temperature unit
ro: Unitatea de temperatura

# _alertstr2
source: This button opens a browser window and connects to the help page for this widget. Do you wish to proceed?
ro: Acest buton deschide o fereastra de browser si se conecteaza la pagina de ajutor pentru acest widget. Nu doriti sa continuati?

source: Open Browser Window
ro: Deschideti fereastra de browser

source: No Thanks
ro: Nu multumesc

# _alertstr3
source: This button opens a browser window and connects to the Steampunk widgets page on my site. Do you wish to proceed?
ro: Acest buton deschide o fereastra de browser si se conecteaza la pagina de widget-uri Steampunk pe site-ul meu. Nu doriti sa continuati?

# _alertstr4
source: Help support the creation of more widgets like this, send us a beer. This button opens a browser window and connects to the Paypal donate page for this widget. Will you be kind and proceed?
ro: Ajutor sprijini crearea de mai multe widget-uri, cum ar fi acest lucru, trimite-ne o bere! (Acest buton deschide o fereastra de browser si se conecteaza la pagina de Paypal dona pentru acest widget). Vei fi un fel si sa continuati?

# _alertstr5
source: Help support the creation of more widgets like this. Buy me a small item on my Amazon wishlist! (This button opens a browser window and connects to my Amazon wish list page). Will you be kind and proceed?
ro: Ajutor sprijini crearea de mai multe widget-uri, cum ar fi acest lucru. Cumpara-mi un punct mic de pe lista mea Amazon! (Acest buton deschide o fereastra de browser si se conecteaza la pagina de lista mea de dorinte Amazon). Vei fi un fel si sa continuati?

# _alertstr6
source: Log in and vote for the widget on Rocketdock (This button opens a browser window and connects to the Rocketdock page where you can login and give the widget a 5 star rating...). Will you be kind and proceed?
ro: Autentificare si sa voteze pentru widget-ul de pe RocketDock (Acest buton deschide o fereastra de browser si se conecteaza la pagina RocketDock care poate da widget un rating de 5 stele ...). Vei fi un fel si sa continuati?

# _alertstr7
source: Download latest version of the widget (this button opens a browser window and connects to the widget download page where you can check and download the latest zipped .WIDGET file). Proceed?
ro: Descarcati cea mai recenta versiune a aplicatiei (acest buton se deschide o fereastra de browser si se conecteaza la pagina de download widget unde puteti verifica si descarca cea mai recenta arhivat fisierul widget.). Proceda?

# _alertstr8
source: Visiting the support page (this button opens a browser window and connects to our contact us page where you can send us a support query or just have a chat). Proceed?
ro: De a vizita pagina de suport (acest buton se deschide o fereastra de browser si se conecteaza la pagina Contactati-ne unde ne puteti trimite o interogare de suport sau doar au un chat). Proceda?

# _alertstr9
source: The source weather feed is currently producing no valid data. Trying again in
ro: Vremea sursa de hrana pentru animale de date este disponibila( în prezent. Reîncercat,i mai târziu.

# _alertstr10
source: Rather weird - Network does not seem to providing the expected data - the feed might be unavailable or your computer may be disconnected from the internet, check your firewall, check the connection. The feed goes offline rarely but it does happen. If it does occur hold on a while and it will most likely correct itself... Technicians are probably working on the feed now.
ro: Destul de ciudat - ret,ea nu par sa( furnizeze date - feed ar putea fi indisponibil sau computer poate fi deconectat de la internet, verifica firewall-ul, Verificat,i conexiunea. Feed merge offline rar dar se intampla. În cazul în care aceasta det,ine pe o perioada de timp s,i se va corecta în sine...

source: Online Help
ro: Ajutor online

source: Refresh Metar feed
ro: Refresh Metar alimentare

source: Donate with Paypal
ro: Donati prin Paypal

source: Donate with Amazon
ro: Donati prin Amazon

source: Vote on Rocketdock
ro: Vot cu privire la Rocketdock

source: See More Steampunk Widgets
ro: Vezi mai multe widgeturi Steampunk

source: Download Latest Version
ro: Descarcati ultima versiune

source: Contact Support
ro: Suport contactati

# _Do_not_change_this_code
source: Do NOT change this code unless you have a corresponding language file installed in the correct location. For those languages that are not supported by the YWE - add your own language file below the Resources folder and enter your two letter language code above. We supply a Romanian translation (ro).
ro: Nu schimba acest cod daca nu aveti un fisier limbaj corespunzator. Pentru acele limbi care nu sunt acceptate de catre YWE - adauga propriul fisier de limba sub directorul Resurse si introduceti codul de doua limba scrisoarea de mai sus. Noi furnizam o traducere româna (ro).

# _set_to_use_icao_or_location
source: select to switch between ICAO or location
ro: selectati pentru a comuta între ICAO sau locatie

# _Search_ICAO
source: Select ICAO code
ro: Cauta ICAO

# _Select_the_temperature_unit
source: Select the temperature_unit, fahrenheit or degrees celsius
ro: Selectati unitatea de temperatura. Implicit este scara Celsius.

# _Select_codes_or_locations
source: If you set this switch you will need to enter ICAO codes into the search instead of Location eg. East Midlands ICAO Code: EGNX.
ro: Daca setati acest parametru va trebui sa introduceti Coduri OACI în cautare de loc de amplasare de exemplu. East Midlands Cod ICAO: EGNX.

source: Tooltip Selection
ro: Tooltip Selectie

# _reload_widget
source: Reload Widget (F5)
ro: Reincarca Widget

# _reveal_widget_win
source: Reveal Widget in Windows Explorer
ro: Widget dezvaluie în Windows Explorer

# _reveal_widget_mac
source: Reveal Widget in Mac Finder
ro: Widget dezvaluie în Mac Finder

source: Display Licence Agreement...
ro: Acord de licenta pentru afisare...

source: Click here to raise the weather popup.
ro: Apasa aici pentru a ridica pop-up meteo.

source: Windspeed is
ro: Viteza vantului este

source: Chat about steampunk widgets on Facebook
ro: Chat despre widgeturi Steampunk pe Facebook

# _strength_force
source: force
ro: putere

source: direction
ro: directie

source: Precipitation is
ro: Precipitare este

source: Partly cloudy
ro: Partial inorat

source: Scattered clouds at
ro: Nori imprastiati la

source: Showers in the vicinity
ro: Dusuri in vecinatate

source: Clear skies
ro: Cer senin

source: Vertical visibility
ro: Plafon si vizibilitate OK

source: Overcast
ro: Acoperit de nori

source: Mostly cloudy
ro: Predominant innourat

source: Shallow
ro: Putin adanca

source: Drizzle
ro: Burnita

source: Patches of
ro: Patch-uri de

source: Blowing
ro: Suflare

source: Showers
ro: Averse

source: in the vicinity
ro: in apropiere

source: freezing
ro: congelare

source: Thunderstorm
ro: Furtuna

# _This_is_the_timer_interval
source: This is the timer interval by which the widget gets the data from the source (default 600 seconds or ten minutes). The metar source provider and the location itself determines when the actual data is provided.
ro: Acesta este intervalul temporizator prin care widget-ul prime?te datele de la sursa ( implicit 600 secunde sau zece minute ) . Furnizorul de sursa si METAR locatia in sine determina atunci cand se furnizeaza datele reale.

# _Check_this_box_if_you_want
source: Check this box if you want the widget to 'ting' each time the data is successfully collected.
ro: Bifati aceasta caseta daca doriti ca widget-ul sa 'Ting' de fiecare data cand datele sunt colectate cu succes.

# _This_option_locks_the_widget
source: This option locks the widget in place on your desktop, a locking pin will appear on the rim to show the widget is locked. 1 is locked.
ro: Aceasta optiune blocheaza widget-ul în loc de pe desktop, un stift de blocare va aparea pe janta pentru a afisa widget-ul este blocat. 1 este blocat.

source: Ting when collecting data
ro: Ting atunci cand colectarea de date

# _Select_the_cloud_height_unit
source: Select the cloud height unit. The default is the imperial (ft). Windspeed is measured in knots so be aware, this won't change knots to km/h as despite popular belief knots are not actually an imperial measurement and are still used worldwide though ALL metric counties.
ro: Selectati unitatea de inaltime nor. Implicit este imperial (ft). Acest lucru nu se va schimba noduri la km/h, ca noduri nu sunt o masuratoare imperiala

source: Data Timer:
ro: Date temporizator:

source: Widget locked:
ro: widget blocat:

source: Metric or Imperial
ro: Metrice sau imperiale:

source: Metar Search
ro: Contor de cautare

source: Language Code
ro: Codul de limba

source: Language Selection
ro: Selectare limba

# _Shows_the_weather_pop_up_panel
source: Shows the weather pop up panel as an alternative to the tooltips.
ro: Arata vremea in pop-up panou ca o alternativa la tooltips.

source: Shows the weather panel permanently.
ro: Prezinta panoul meteo permanent.

# _Enables_the_mini_clock
source: Enables the mini clock and other bits on the weather pop-up panel.
ro: Activeaza mini-si ceasul de alti biti de pe panoul pop-up meteo.

# _Enter_the_name_of_any_of_your_installed_fonts
source: Enter the name of any of your installed fonts - will be used in the information pop-up box that appears when you double-click on the moon. By default will use Courier New. A very nice font to use here is the Chanticleer Roman font at 12pt size.
ro: Se indica numele oricare dintre fonturile instalate - vor fi folosite în informa?iile caseta pop - up care apare atunci când faceti clic dublu pe luna. În mod implicit se va folosi Courier New. Un font foarte frumos de a folosi aici este fontul Chanticleer roman la dimensiunea 12pt.

# _Choose_the_font_size_of_the_popup_text
source: Choose the font size of the popup text above.
ro: Alegeti dimensiunea fontului textului pop-up de mai sus.

source: Weather Pop-up:
ro: Pop-up meteo:

source: Weather Panel:
ro: Panou meteo:

source: Mini Clock:
ro: Mini ceas:

source: Pop-up panel text size:
ro: Marime text al panoului pop-up:

source: Snow grains
ro: Boabe de zapada

source: Ice_crystals
ro: Cristale de gheata

source: Ice_pellets
ro: Grindina

source: Small_hail
ro: Grindina mica

source: Unknown
ro: Necunoscut

source: Mist
ro: Aburi

source: Smoke
ro: Fum

source: Volcanic ash
ro: Cenusa vulcanica

source: Widespread dust
ro: Praf omniprezent

source: Sand
ro: Nisip

source: Haze
ro: Ceata

source: Dustdevils
ro: Diavoli de praf

source: Strong winds
ro: Vânturi puternice

source: Tornado
ro: Tornada

source: Sandstorm/duststorm
ro: Furtuna de nisip

source: Light
ro: usoara

source: Moderate
ro: Moderat

source: Heavy
ro: Torentiala

# _disable_this_to_ignore_any_failures
source: Disable this to ignore any failures to connect to the weather server and prevent the alerts.
ro: Nu fi de acord ca acest lucru sa ignore orice eroare de a se conecta la serverul meteo ?i pentru a preveni alertele.

source: Alerts
ro: Alerte

source: The current wind direction is
ro: Directia curenta a vântului este

source: Press to show previous days forecast
ro: Presa pentru a afisa prognoza de zile anterioare

source: Press to show next days forecast
ro: Presa pentru a arata urmatoare prognoza zile
